'''''
Задача 16: Требуется вычислить, сколько раз встречается некоторое число X в массиве A[1..N].
Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

*Пример:*

5
    1 2 3 4 5
    3
    -> 1
'''
len_my_list = int(input('Введи длину списка: '))
x = int(input('Введи число "Х": '))
my_list = [i for i in range(1, len_my_list + 1)]  # Создаем список
print(my_list)
for i in my_list:
    count = my_list.count(x) # Определяем количество вхождений
print(count)




# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X.
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве.
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
#
# *Пример:*
#
# 5
#     1 2 3 4 5
#     6
#     -> 5
len_my_list = int(input('Введи длину списка: '))
x = int(input('Введи число "Х": '))
my_list = [i for i in range(1, len_my_list + 1)]  # Создаем список
print(my_list)

if (x <= my_list[-1]) and (x >= my_list[0]):
    print(f'Ближайшее число к Х: {x}')
if x >= my_list[-1]:
    print(f'Ближайшее число к Х: {my_list[-1]}')
if x <= my_list[0]:
    print("Повтори ввод!")
