

# Задача 30:  Заполните массив элементами арифметической прогрессии. Её первый элемент,
# разность и количество элементов нужно ввести с клавиатуры. Формула для получения n-го
# члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# Ввод: 7 2 5
# Вывод: 7 9 11 13 15


first_element = int(input('Enter first element: '))
numbers_element = int(input('Enter количество элементов: '))
dif_numb = int(input('Введи разность: '))
my_list = [first_element]
for i in range(numbers_element):
    first_element = first_element + dif_numb
    my_list.append(first_element)
print(my_list)




# Задача 32: Определить индексы элементов массива (списка),
# значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума
# и не больше заданного максимума)

# Ввод: [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
#
# Диапазон от 6 до 12
#
# Вывод: [1, 9, 13, 14, 19]

my_list = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
min_number = int(input('Enter min number: '))
max_number = int(input('Enter max number: '))
for i in range(len(my_list)):
    if min_number <= my_list[i] <= max_number:
        print(i)


# Задача №4

# Дано 20+ значное целое число, проверить его на делимость на 7
#
# Ввод 234523642345789812354678654323454919865
#
# Вывод Делится

a = 234523642345789812354678654323454919865
if a % 7 == 0:
    print('делится')
else: print('не делится')