# Задача 2: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |
# *** Рассмотрите случай числа с плавающей точкой и не обязательно 3-х значного

# number = float(input('Введи число '))

number = float(input('Введи число '))
while number != int(number):
    number *=10
number = int(number)
sum = 0
while number > 0:
    n = number % 10
    sum = sum + n
    number = number // 10
print(sum)

# Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов.
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа сделали одинаковое
# количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?
# 6 -> 1  4  1
# 24 -> 4  16  4
# 60 -> 10  40  10

bird = int(input('Введи общее четное число журавликов '))

if bird % 2 == 0 and bird >= 4:
    girl = bird / 2
    boy = girl /2

    print(f'Катя сделала {girl} журавликов, а мальчики по {boy}')
else:
    print('Введи верное значение!')


# Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером.
# Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# 385916 -> yes
# 123456 -> no
# ******** Рассмотрите вариант разделения на правую и левую часть произвольно, но не меняя порядок цифр.
#

tickets = input('Введите номер билета: ')
left = int(tickets[0]) + int(tickets[1]) + int(tickets[2])
right = int(tickets[3]) + int(tickets[4]) + int(tickets[5])
if left == right:
    print('Yes')
else:
    print('NO')
# Задача 8: Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается
# сделать один разлом по прямой между дольками (то есть разломить шоколадку на два прямоугольника).
#
# 3 2 4 -> yes
# 3 2 1 -> no

n = int(input('n = '))
m = int(input('m = '))
k = int(input('k = '))

if k < n*m and ((k % n ==0 ) or (k % m ==0)):
    print('yes')
else:
    print('no')
